game = {
    ALLY_PLAYER = nil,
    running = true,
    diff = 0,
    rebornQty = 0,
    unitsReborn = {},
    playerData = {
        prevPower = {},
        prevKill = {},
        --- 巅峰战力
        power = {},
        -- 信使
        courier = {},
        -- 英雄天赋
        gift = {},
    },
    shopsConfig = {
        { "稀奇古怪黑科技", { -1088, 1088 } },
        { "稀奇古怪黑科技", { 1088, 1088 } },
        { "稀奇古怪黑科技", { 1088, -1088 } },
        { "稀奇古怪黑科技", { -1088, -1088 } },
        { "神秘之地", { 0, -512 } },
        --
        { "巫毒商店", { -512, 512 } },
        { "冷兵器磨坊", { 0, 512 } },
        { "火器铁铺", { -512, 0 } },
        { "科技车间", { -512, -512 } },
        --
        { "奇异屋", { 512, 512 } },
        { "铁箱子", { 512, 0 } },
        { "营地", { 512, -512 } }
    },
}
