game = {
    ALLY_PLAYER = nil,
    running = true,
    diff = 0,
    sevenStone = {},
    island = {},
    unitsReborn = {},
    playerDZData = {
        -- 称号、击杀数、战力、黄金、木头
        info = {},
        -- 英雄种类、等级
        hero = {},
        -- 信使种类、等级
        courier = {},
        -- 物品栏物品（index、次数、位置）
        item = {
            hero = {
                _12 = {},
                _34 = {},
                _56 = {},
            },
            courier = {
                _12 = {},
                _34 = {},
                _56 = {},
            },
        },
        -- 4个天赋技能
        gift = {},
    },
    playerCourier = {},
    shopsConfig = {
        { "稀奇古怪黑科技", { -1088, 1088 } },
        { "稀奇古怪黑科技", { 1088, 1088 } },
        { "稀奇古怪黑科技", { 1088, -1088 } },
        { "稀奇古怪黑科技", { -1088, -1088 } },
        { "神秘之地", { 0, -512 } },
        --
        { "巫毒商店", { -512, 512 } },
        { "冷兵器磨坊", { 0, 512 } },
        { "火器铁铺", { -512, 0 } },
        { "科技车间", { -512, -512 } },
        --
        { "奇异屋", { 512, 512 } },
        { "铁箱子", { 512, 0 } },
        { "营地", { 512, -512 } }
    },
    -- 左上第一顺时针设定的
    rebornStonePoint = {},
    rebornStone = {
        { type = 1, loc = { -1154, 247 }, reborn = { -1000, -195 } }, -- 七灵岛(这个必须放第一)
        { type = 2, loc = { 740, -583 }, reborn = { 0, -512 } }, -- 七灵岛
        { type = 2, loc = { -1740, -2900 }, reborn = { -1500, -3730 } }, -- 斑斓海
        { type = 2, loc = { 2347, -5883 }, reborn = { 1800, -5400 } }, -- 秘潭幽林
        { type = 1, loc = { 4860, 2825 }, reborn = { 4612, 2302 } }, -- 铁环山
        { type = 1, loc = { 7800, -1016 }, reborn = { 8134, -1429 } }, -- 铁环山
        { type = 2, loc = { 6274, -3830 }, reborn = { 5375, -4444 } }, -- 遗迹草原
        { type = 2, loc = { -4095, 2550 }, reborn = { -4611, 2927 } }, -- 冰极雪原
        { type = 2, loc = { -425, 6227 }, reborn = { -800, 5907 } }, -- 火蛇岛
        { type = 1, loc = { -1700, 8284 }, reborn = { -1100, 8386 } }, -- 火蛇岛
    },
    portal = {
        { from = { -126, -4479 }, to = {  -1146, -4417 } }, -- 秘潭幽林北部下去七灵、斑斓海交界
        { from = { -716, -4424 }, to = {  -377, -4475 } }, -- 七灵、斑斓海交界上去秘潭幽林北部小路
        { from = { -5312, -638 }, to = {  -5307, -1793 } }, -- 冰极雪原下去斑斓海
        { from = { -5374, -1410 }, to = {  -4991, -251 } }, -- 斑斓海洞穴上去冰极雪原
        { from = { -2052, 8042 }, to = {  -1800, 7400 } }, -- 冰极雪原下去火蛇岛
        { from = { -1982, 7746 }, to = {  -2882, 8208 } }, -- 火蛇岛上去冰极雪原
    },
}
